In [ ]:
import sqlite3 as sq

In [ ]:
db = sq.connect('school.db')

In [ ]:
query = '''CREATE TABLE student (
id INTEGER PRIMARY KEY AUTOINCREMENT,
nama VARCHAR(50),
kelas INTEGER,
nilai INTEGER,
tanggal_lahir VARCHAR(20),
asal VARCHAR(50)
);'''

cursor_db = db.cursor()
cursor_db.execute(query)

In [ ]:
query = '''INSERT INTO student (nama, kelas, nilai, tanggal_lahir, asal) VALUES
('Yuji Itadori', 1, 8, '20 Maret', 'Jakarta'),
('Megumi Fushiguro', 1, 5, '22 Desember', 'Jakarta'),
('Nobara Kugisaki', 1, 8, '7 Agustus', 'Jakarta'),
('Maki Zenin', 2, 8, '21 Mei', 'Jakarta'),
('Panda', 2, 3, '5 Agustus', 'Jakarta'),
('Toge Inumaki', 2, 9, '23 Oktober', 'Jakarta'),
('Yuta Okkotsu', 2, 6, '7 Mei', 'Jakarta'),
('Kirara Hoshi', 3, 9, '14 November', 'Jakarta'),
('Kinji Hakari', 3, 6, '21 Mei', 'Jakarta'),
('Aoi Todo', 3, 10, '22 April', 'Jogja'),
('Kamo Noritoshi', 3, 6, '3 November', 'Jogja'),
('Mechamaru', 2, 9, '13 Januari', 'Jogja'),
('Mai Zenin', 2, 6, '30 Januari', 'Jogja'),
('Nishimiya Momo', 2, 8, '5 September', 'Jogja'),
('Kasumi Miwa', 2, 9, '15 Februari', 'Jogja');
'''

cursor_db.execute(query)
db.commit()

In [ ]:
query = '''SELECT nama, kelas FROM student'''

a = cursor_db.execute(query)
a.fetchall()

[('Yuji Itadori', 1),
 ('Megumi Fushiguro', 1),
 ('Nobara Kugisaki', 1),
 ('Maki Zenin', 2),
 ('Panda', 2),
 ('Toge Inumaki', 2),
 ('Yuta Okkotsu', 2),
 ('Kirara Hoshi', 3),
 ('Kinji Hakari', 3),
 ('Aoi Todo', 3),
 ('Kamo Noritoshi', 3),
 ('Mechamaru', 2),
 ('Mai Zenin', 2),
 ('Nishimiya Momo', 2),
 ('Kasumi Miwa', 2)]

In [ ]:
def update_data(nama, kolom, nilai):
  query = f'''
        UPDATE student
        SET
            {kolom} = {nilai}
        WHERE
            nama = "{nama}"
        '''

  cursor_db = db.cursor()
  cursor_db.execute(query)
  db.commit()

In [ ]:
try:
  update_data('Panda', 'nilai', (3+8)/2)
  print('data succesfully updated')
except Exception as e:
  print(f"failed: {e}")

data succesfully updated

In [ ]:
query = '''SELECT * FROM student'''

a = cursor_db.execute(query)
a.fetchall()

[(1, 'Yuji Itadori', 1, 8, '20 Maret', 'Jakarta'),
 (2, 'Megumi Fushiguro', 1, 5, '22 Desember', 'Jakarta'),
 (3, 'Nobara Kugisaki', 1, 8, '7 Agustus', 'Jakarta'),
 (4, 'Maki Zenin', 2, 8, '21 Mei', 'Jakarta'),
 (5, 'Panda', 2, 5.5, '5 Agustus', 'Jakarta'),
 (6, 'Toge Inumaki', 2, 9, '23 Oktober', 'Jakarta'),
 (7, 'Yuta Okkotsu', 2, 6, '7 Mei', 'Jakarta'),
 (8, 'Kirara Hoshi', 3, 9, '14 November', 'Jakarta'),
 (9, 'Kinji Hakari', 3, 6, '21 Mei', 'Jakarta'),
 (10, 'Aoi Todo', 3, 10, '22 April', 'Jogja'),
 (11, 'Kamo Noritoshi', 3, 6, '3 November', 'Jogja'),
 (12, 'Mechamaru', 2, 9, '13 Januari', 'Jogja'),
 (13, 'Mai Zenin', 2, 6, '30 Januari', 'Jogja'),
 (14, 'Nishimiya Momo', 2, 8, '5 September', 'Jogja'),
 (15, 'Kasumi Miwa', 2, 9, '15 Februari', 'Jogja')]

In [ ]:
def delete_data(nama):
    query = f'''
        DELETE FROM student
        WHERE
            nama = "{nama}"
        '''

    cursor_db = db.cursor()
    cursor_db.execute(query)
    db.commit()

In [ ]:
try:
  delete_data('Kinji Hakari')
  print('data succesfully deleted')
except Exception as e:
  print(f"failed: {e}")

data succesfully deleted

In [ ]:
query = '''SELECT * FROM student'''

a = cursor_db.execute(query)
a.fetchall()

[(1, 'Yuji Itadori', 1, 8, '20 Maret', 'Jakarta'),
 (2, 'Megumi Fushiguro', 1, 5, '22 Desember', 'Jakarta'),
 (3, 'Nobara Kugisaki', 1, 8, '7 Agustus', 'Jakarta'),
 (4, 'Maki Zenin', 2, 8, '21 Mei', 'Jakarta'),
 (5, 'Panda', 2, 5.5, '5 Agustus', 'Jakarta'),
 (6, 'Toge Inumaki', 2, 9, '23 Oktober', 'Jakarta'),
 (7, 'Yuta Okkotsu', 2, 6, '7 Mei', 'Jakarta'),
 (8, 'Kirara Hoshi', 3, 9, '14 November', 'Jakarta'),
 (10, 'Aoi Todo', 3, 10, '22 April', 'Jogja'),
 (11, 'Kamo Noritoshi', 3, 6, '3 November', 'Jogja'),
 (12, 'Mechamaru', 2, 9, '13 Januari', 'Jogja'),
 (13, 'Mai Zenin', 2, 6, '30 Januari', 'Jogja'),
 (14, 'Nishimiya Momo', 2, 8, '5 September', 'Jogja'),
 (15, 'Kasumi Miwa', 2, 9, '15 Februari', 'Jogja')]

In [ ]:
def insert_data(nilai):
    query = f'''
        INSERT INTO student (nama, kelas, nilai, tanggal_lahir, asal)
        VALUES {nilai}
        '''

    cursor_db = db.cursor()
    cursor_db.execute(query)
    db.commit()

In [ ]:
try:
  insert_data("('Junpei', NULL, NULL, NULL, 'Jakarta')")
  print('data succesfully inserted')
except Exception as e:
  print(f"failed: {e}")

data succesfully inserted

In [ ]:
query = '''SELECT * FROM student'''

a = cursor_db.execute(query)
a.fetchall()

[(1, 'Yuji Itadori', 1, 8, '20 Maret', 'Jakarta'),
 (2, 'Megumi Fushiguro', 1, 5, '22 Desember', 'Jakarta'),
 (3, 'Nobara Kugisaki', 1, 8, '7 Agustus', 'Jakarta'),
 (4, 'Maki Zenin', 2, 8, '21 Mei', 'Jakarta'),
 (5, 'Panda', 2, 5.5, '5 Agustus', 'Jakarta'),
 (6, 'Toge Inumaki', 2, 9, '23 Oktober', 'Jakarta'),
 (7, 'Yuta Okkotsu', 2, 6, '7 Mei', 'Jakarta'),
 (8, 'Kirara Hoshi', 3, 9, '14 November', 'Jakarta'),
 (10, 'Aoi Todo', 3, 10, '22 April', 'Jogja'),
 (11, 'Kamo Noritoshi', 3, 6, '3 November', 'Jogja'),
 (12, 'Mechamaru', 2, 9, '13 Januari', 'Jogja'),
 (13, 'Mai Zenin', 2, 6, '30 Januari', 'Jogja'),
 (14, 'Nishimiya Momo', 2, 8, '5 September', 'Jogja'),
 (15, 'Kasumi Miwa', 2, 9, '15 Februari', 'Jogja'),
 (16, 'Junpei', None, None, None, 'Jakarta')]

In [ ]:
query = '''SELECT asal, AVG(nilai) FROM student GROUP BY asal'''

a = cursor_db.execute(query)
a.fetchall()

[('Jakarta', 7.3125), ('Jogja', 8.0)]

In [ ]:
query = '''SELECT * FROM student ORDER BY nilai DESC'''

a = cursor_db.execute(query)
a.fetchall()

[(10, 'Aoi Todo', 3, 10, '22 April', 'Jogja'),
 (6, 'Toge Inumaki', 2, 9, '23 Oktober', 'Jakarta'),
 (8, 'Kirara Hoshi', 3, 9, '14 November', 'Jakarta'),
 (12, 'Mechamaru', 2, 9, '13 Januari', 'Jogja'),
 (15, 'Kasumi Miwa', 2, 9, '15 Februari', 'Jogja'),
 (1, 'Yuji Itadori', 1, 8, '20 Maret', 'Jakarta'),
 (3, 'Nobara Kugisaki', 1, 8, '7 Agustus', 'Jakarta'),
 (4, 'Maki Zenin', 2, 8, '21 Mei', 'Jakarta'),
 (14, 'Nishimiya Momo', 2, 8, '5 September', 'Jogja'),
 (7, 'Yuta Okkotsu', 2, 6, '7 Mei', 'Jakarta'),
 (11, 'Kamo Noritoshi', 3, 6, '3 November', 'Jogja'),
 (13, 'Mai Zenin', 2, 6, '30 Januari', 'Jogja'),
 (5, 'Panda', 2, 5.5, '5 Agustus', 'Jakarta'),
 (2, 'Megumi Fushiguro', 1, 5, '22 Desember', 'Jakarta'),
 (16, 'Junpei', None, None, None, 'Jakarta')]